app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.all

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @comment = Comment.new
    @post = Post.find(params[:id])

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "dsfsjf"], ["body", "kdlsjfsadk"], ["created_at", "2024-06-02 12:01:27.528557"], ["updated_at", "2024-06-02 12:01:27.528557"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_post
      @post = Post.find(params[:id])